ui/backend/audit/cases/flat_plate_rans_sst/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| AI-CFD-V2 Phase 1 step 2b scaffold | OpenFOAM 11 | flat_plate_rans_sst    |
| k = 1.5 * (I*U)^2 = 1.5 * (0.01 * 30)^2 = 0.135                            |
|   per manifest.bc_contract.inlet.k.intensity = 0.01                        |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.135;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.01;          // matches manifest
        value           uniform 0.135;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall
    {
        // matches manifest.bc_contract.wall.k.type = kqRWallFunction
        type            kqRWallFunction;
        value           uniform 1e-12;
    }
    top
    {
        type            symmetryPlane;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
